# ======================================================================
# 练习001：
# 水仙花数（Narcissistic number）：计算三位整数（100～999）的水仙花数。
# 水仙花数也称为自恋数、自幂数 或阿姆斯壮数（Armstrong number）。
# 它是指每一位的立方相加等于该数自己，如：153 = 1^3 + 5^3 + 3^3。
# ======================================================================


def armstrong_num() -> list:
    armstrong_nums = []     # 创建空列表用于保存所有的水仙花数

    for num in range(100, 1000):
        n3 = num // 100                 # 求百位上的数字
        n2 = (num - n3 * 100) // 10     # 求十位上的数字
        n1 = num - n3 * 100 - n2 * 10   # 求个位上的数字

        # 判断当前数字是否为水仙花数
        if (n3**3 + n2**3 + n1**3) == num:
            armstrong_nums.append(num)

    return armstrong_nums


print(armstrong_num())
