# ======================================================================
# 练习008
# 定义一个列表，里面包含有20个左右的学生姓名，请实现随机点名的功能。
# ======================================================================
import random


def call_the_roll(students: list) -> None:
    random_id = random.randint(0, len(students)-1)  # 生成并保存一个不大于学生总人数的随机数
    print('现在开始点名！==>', students[random_id])
    return


students = ['张学友', '刘德华', '黎明', '郭富城', '周杰伦',
            '王力宏', '蔡依林', '李宇春', '杨幂', '赵丽颖',
            '王宝强', '谢霆锋', '李健', '沈腾', '马丽',
            '郭德纲', '岳云鹏', '何炅', '谢娜', '蔡康永']
call_the_roll(students)
