import random


# ================================================================================
# P289 - 练习题5
# 设定的总行数line可以随机修改，修改后仍然能够打印出line行的直角三角形和等腰三角形
# ================================================================================
# 打印直角三角形
def print_right_triangle(line: int = 0) -> None:
    # 如果未指定打印三角形的行数，则随机生成一个1~10的整数作为行数
    if line == 0:
        line = random.randint(1, 10)
    # 观察1：1行1颗星，2行2颗星，3行3颗星……以此类推，n行n颗星
    # 观察2：所有星号都左对齐就形成了一个直角三角形
    print('指定三角形的高为{}，打印该直角三角形如下：'.format(line))
    for i in range(line):
        print('*' * (i + 1))

    return


print_right_triangle(5)
